Revit 2024 API
ComponentRepeater.CanElementBeRepeated Method
 Determines whether an element can be repeated using the RepeatElements method.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015 Subscription Update
Syntax
C#
public static bool CanElementBeRepeated(
	Document ADoc,
	ElementId elementId
)
Visual Basic
Public Shared Function CanElementBeRepeated ( _
	ADoc As Document, _
	elementId As ElementId _
) As Boolean
Visual C++
public:
static bool CanElementBeRepeated(
	Document^ ADoc,
	ElementId^ elementId
)
Parameters
ADoc
Type: Autodesk.Revit.DB.Document
 The document containing the element.
elementId
Type: Autodesk.Revit.DB.ElementId
 The element to be tested.
Return Value
 True if the element can be repeated.
Remarks
 The element must be an adaptive family instance and have no shape handles. At least one placement point must be hosted on a 1D or 2D repeating reference. All other placement points can be hosted on a 0D, 1D or 2D repeating reference, or must be unhosted.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ComponentRepeater Class
Autodesk.Revit.DB Namespace